Revit 2024 API
PathReinforcement.RemovePathReinforcementSystem Method
 Deletes the specified PathReinforcement, and converts its RebarInSystem elements to equivalent Rebar elements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static IList<ElementId> RemovePathReinforcementSystem(
	Document doc,
	PathReinforcement system
)
Visual Basic
Public Shared Function RemovePathReinforcementSystem ( _
	doc As Document, _
	system As PathReinforcement _
) As IList(Of ElementId)
Visual C++
public:
static IList<ElementId^>^ RemovePathReinforcementSystem(
	Document^ doc,
	PathReinforcement^ system
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
 The document.
system
Type: Autodesk.Revit.DB.Structure.PathReinforcement
 A PathReinforcement element in the document.
Return Value
 The ids of the newly created Rebar elements.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The element system was not found in the given document. -or- system does not host Rebar.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace